#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```module.keycloak_prod.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/aa16524f-c3e1-4f5d-8c1f-d110389da57a]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/c20dc315-d7a7-4ecd-a766-ab2c8df7be0e]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=49030071-d786-4868-815d-95c032f6dbf3/028bf50e-19bc-43f7-81a3-1d41af98a0a8]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9e25e9a7-64a2-45d0-97df-1bcd40e16740/0bc5094b-0395-45f2-ba79-2d48adbb56d3]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c7e890ec-d904-4bb1-87cf-38f051e272b0]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/49553bd4-bfc5-49c6-bc79-a5cb1a7b92b1]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=349b1549-669e-41a4-9bd3-25967a5dae49/021e71ef-9525-4847-8f6b-41cadec94075]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=8d3188f7-65e7-4d63-adcc-acf26ee2c3bb/cbd1983d-ad25-48c4-821f-b4421f492954]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/094c0261-5ce9-4602-b026-6a9b78741e5a]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c41b5db9-f3d9-4131-a035-5d5bf7354658/8ddebd37-3ccb-441b-8b91-0aec3231ea5d]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0714393e-229e-4b5a-8acb-20084416803e]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/3e40aad2-428f-453f-a88c-9230d9108b71]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7303c437-2799-42bf-b402-ca257df3190b/78221f62-242f-4db5-bd10-8e88024f2202]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/73314c6c-940f-4a4a-8e19-99812eadacf7]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/6a761779-7377-4e78-a057-01f9b44b7240]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9b22c149-9366-469f-a28a-902d6f23a0f0/a4419575-b9d2-49d5-be6f-bcb6c590c393]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=fc65e827-bbfd-4daf-9579-fe5a18af0432/9124adb0-5452-4beb-84fc-af44fe6ba73f]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/38d37f7e-d22b-433c-b1a8-1cbffc413697]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/ceca7803-8f6d-45ee-b7bd-2fe5297be84b]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0799aeec-db43-4158-ab80-f24b4bc314fc/463e6fc1-1986-4cbd-96f6-71d4fc5a3483]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2391c9f6-dab9-4ce2-be99-5ac4a6507f2b/ec7f9402-bca4-4e23-abdf-7d638c9a48fd]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/6125e99f-17bc-481d-9b13-c41ca861dd90]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=67e9942a-31b4-481d-b9d3-0dfd91eb15b1/19f7edee-6468-4a0d-8424-863800a54b8f]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c0dfcd53-d607-4e14-8f3b-bd3471ed5d95]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/86b2128d-3ced-457a-8ea6-d2983a251d2f]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=be1d85eb-b8c7-4d84-a58a-b7ccdb3d4020/40410dcd-a040-49db-93e9-8b27ff11c6f3]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c601ab29-3601-41fb-8a5e-83ec737e8e57]
module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a08293fc-5476-4ac3-acf5-1d6ac4857080/30f3863c-d4eb-4478-bbaf-d88828fa38d6]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/15710116-e834-488d-b0ea-39e31a8dbca0]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=08c1273d-6851-4193-8e5e-07d77cfd3dcd/9d44b127-d2f7-4153-91bb-01d6aea5ab9f]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bb3431c2-3a0c-475d-8ab2-b58919edeab2/74003394-2fdb-47f9-b49b-48b63ebbf61c]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/ab19fea3-e590-465f-bfa5-5ff2a56ed0c7]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/f1a83d37-d855-4012-a1a1-346427c1fcc7]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e8c8fccd-7173-4e27-a385-082ac2bbd8b6/44ffbf96-9eb7-406c-a0f2-31f508c6950c]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/f0eb3cf1-9df1-4c0d-a243-30b310ea25fc]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=58417bb9-4aca-4b90-8a27-a2cdb8b35d98/c5217361-6414-4a31-ac42-3c98b8374375]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/c4336083-1d20-402e-a699-766caad34165]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=032d1b61-b172-403f-b896-2436670ddc11/730c6a21-bc96-4ac2-bebe-30e80f8e7b2d]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/d38448a6-9d39-412d-82cd-0e47ca6f509c]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e9864725-fe6c-4c06-b8e1-3cb699092da4/edcbfa32-0432-489c-870a-26c0b513ff3d]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=cda91640-812f-43d6-89cf-157649d110da/74c62da3-0579-45a3-99ee-d49a36342d65]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/eafe733e-c725-451c-a7b1-ec4daff5c0e4]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/5e5101d4-3eac-43e0-a01e-6b18efb99283]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=47f68b75-a001-445f-a4ef-5b7a9830f9a7/cb2a598e-ab9b-438b-a34b-3bc7ab4e1bb6]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6d73d7de-6824-4b40-852e-c769964eb3ee/e14041a8-874a-4bd5-8f06-91912def78b3]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6ef64086-8e8c-4feb-a94b-04e3cbfa8d1c]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/8a38efbb-4c75-4af0-8d48-8ec2f20884f3]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bdc9262c-c5ed-4104-b605-b1f8487efc24/c359625a-32ec-4c5a-9843-9f5f1b82873a]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3bb01387-da9d-4ed5-a07c-73262f592c10/02372aeb-eb91-46c6-98d4-4355d0145e79]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/25223477-962e-41e1-b9f5-daa75e9ccb84]
module.keycloak_prod.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/7a8ce128-dd71-4211-b8b1-1094821e244c]
module.keycloak_prod.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f47282e-b20d-4dd4-9817-facf5ddd6102/faa01787-7412-4285-89fe-4a44b8bb9ca7]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9ee69a66-e835-4846-8f0c-dd139dcb0e9f/4da65ab8-d408-447d-b037-80ab37ee9bad]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=health-gateway-gold/236df2b1-8196-4d3d-a7a6-960efd7c4846]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=edb8f481-79d7-4a5b-a0e7-8f434fa9788f/70b668f1-461c-4c0b-884e-2bee77e7fb26]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=health-gateway-gold/262d68a4-71e0-475e-8b2a-f5d5d9496706]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/5d9a7fc8-60bf-4166-a17d-f9822e41ccae]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c6ad0cc2-7508-4129-8bad-c70f8422dd2d/d433bde6-a69a-4f4f-8711-2ded84816e9f]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/651e5e4a-30b6-4be6-bea6-93589311725d]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e722f3e1-2ee6-473c-a6a8-e181b3060cfa/2e029d30-cabd-4c50-b858-71b588cc647a]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/88a7576e-c63c-4721-a138-6d834d7f0cd4]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=8b2ee13e-677e-475e-8b63-053d763bea63/12184868-9137-47dd-8e0d-25d82839b205]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/fe53c0e1-1454-416b-b09d-47cdf60ecf1e]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=109c38ca-c28f-4442-859c-333c5c32ef23/3a1ffbd1-8e64-448d-8196-b8daafc1d3ea]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/981bb648-d78a-4d84-a49a-c78972833212]
module.keycloak_dev.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=01b68a37-604c-4d20-a246-740a3df3d6ec/3c3c3f35-b762-4330-ba73-ef6fbe34f205]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/51b532c8-c8bb-411c-ac87-f5a220c94a70]
module.keycloak_dev.module.custom_realms.module.health-gateway-gold.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0bd54292-483c-4d89-9156-d2e2dc1e8a4e/144268a2-7ba4-4209-b23b-0fff47e0fba7]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fe7baf4e-4634-43b4-9303-5d0f93d4a52b]
module.keycloak_prod.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=55d133a7-9bf8-4d52-9451-0655f779bf18/e6b2d779-126b-4b2c-8689-2411b06b1085]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/1194d23a-3f99-4e60-ae92-2f71acb8b6b0]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5d43d65f-b26f-4afb-ace5-3cdbc714789d/b278a1c9-8ca0-468c-b648-c26d4dd9c0ba]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fff843cb-9373-40d3-9dde-c8d432bfba13]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=922f7e74-a597-453a-b443-378264d3cea6/651a4acf-abe0-4827-ab44-1976ac819466]
module.keycloak_dev.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/77d9baa8-f391-4c97-9a9d-d8eba83d05f0]
module.keycloak_dev.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a3a583b7-d44c-4df9-a420-43d0d360b021/2a2973e0-44f6-48a6-a146-cef00421ba97]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/3b594074-0ff2-4961-a12b-eeb030650ebb]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=26951fe7-5f78-449d-8ce8-4f956e37e389/defe2eb9-2a5c-4e1c-9af9-f0830735a2ac]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f442c951-e45f-4ffa-926d-5e9a62f0d32f/694f579b-24e3-4457-a005-7d1207211624]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/951e6dfc-70fe-4cc8-9322-6a6a59687724]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/e0dc8ecb-8cb1-4dac-9978-72d846bd3abd]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5bdb3d80-7a3a-4806-99f1-405f9079943e/b06e72b7-679d-4e8e-b5f4-9604ec5fb244]
module.keycloak_dev.module.custom_realms.module.social.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/b614777d-8491-4c1c-baa4-091ad69a9604]
module.keycloak_dev.module.custom_realms.module.social.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=cd1c7af2-3931-4e03-9983-d9c517047206/54842f0b-1323-4d7b-8da9-3d1d83f738ca]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/9a9704e3-c169-4b63-a9b1-ed185577dc03]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=eccb0d4c-2987-4e9a-9303-f9dd141cb4c1/352d63fd-a410-405a-94fc-01164f9308c5]
module.keycloak_dev.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/90562520-6864-4f3e-96d0-5b824c488588]
module.keycloak_dev.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=303a7347-4d04-4aa5-84eb-d1c83adeeb98/9c362394-9a00-497b-9247-e895e336a14a]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a55b2011-beaa-43df-ad04-bd1add84ae01/01750aec-688b-46d2-886b-c49b0b46cab3]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/734a7828-4ccd-480b-af41-12df4f611fec]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4366fa33-067f-487a-8de1-e212b7741167/3484e828-d4c4-4480-94ce-7efbc7db34ab]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c42728f6-a3e5-4041-9554-64146cd0c334]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f220d10b-c931-471c-82f4-975915b516aa/0fbe31ce-20ce-423a-96cc-2bd512bb187b]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/817dd11e-f593-49a6-b443-0295d26a243b]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a4a423b9-bf19-4e74-a03f-fd74379402d7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f745bfb-33c1-44ae-a206-1aef4cd962b9/122c16c9-bd55-4ad4-bd50-3fe049d33ed9]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=522d6826-ad6e-4e97-9f91-d5649a3ef9c4/a96babe3-664f-469b-8154-820987f75824]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/18aeffa5-71c8-4ac3-9d19-337c5b87fba8]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/d2bcce30-10af-480d-af6f-c7fac2e0c76a]
module.keycloak_dev.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=67367380-0533-47cd-892e-091e50e0fa6b/b6858bd2-0f7b-4df2-a2a1-bc2319cfb099]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/65d3d23f-c9d9-48ae-a492-872980eaaa6c]
module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5b3b6edf-07b1-4c16-8ff0-fc04972be045/9f409cb6-ea27-43fc-a469-2e77a5fbf482]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/869066b3-22b5-4fa4-80bd-1258571a028d]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b4f70925-3cc5-4a2e-9506-389b3ab45db1/01d9c4a4-5813-46dd-b71f-7502501c2b22]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/de627ca7-f762-42ae-9fd1-9f2d32f944df]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0eb6df65-f6b9-4abe-88be-dc54c59d700d/29640f4b-0b47-4bed-851b-ccd9b181f270]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/2625975f-ffa0-4640-a5d7-bd01d48c9db1]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e394ccd7-96be-4856-890e-b583c39094b8/c9a4b34f-78d6-4243-9ee4-2d5d148110e8]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/68694587-f318-435e-a2c6-345f4174bc5f]
module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=61eb8a27-75c6-4174-b799-cb3f7f372671/bf4b6c49-7fd6-4cb4-a883-96f3448081e8]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=zorin-dev-custom-realm/011bbb33-0c73-4640-bb77-2764a76d68c4]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b7f6a9d7-41bb-4709-b55a-ff6d150b9c36/2b1a10e9-0a36-47af-affe-8385e15a7844]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4fce45a3-d608-4a46-9fb4-b2d170723b9c/2596b0c8-0157-41f2-a0ee-beaee4495840]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fc92cf23-4b42-42d2-9b03-b75359ae6e7c]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/e6b0f6e5-a719-4194-8cf3-cbdb49866e98]
module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=958e8320-7584-48c8-90c1-0042ac56d8d3/198a7735-4af7-48b0-a9d9-a296de48c6f0]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/f6bdc8e3-7cbb-40cb-af49-60e4bb3044a3]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=faa3e861-13c4-4d5c-9eaa-88cc9a1429e1/f3b99df6-fcde-434d-8eda-2984046a319b]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=35cfe89c-6c99-45c6-be16-034957741460/c3e96dc1-58f0-42b8-860a-a5884e8f7c43]
module.keycloak_dev.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/ac37b7fd-8d58-4c79-9d3c-7208d6a436c3]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/5747366e-8ccf-461e-a323-660f7806c4ed]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=zorin-dev-custom-realm/e7a8d314-bd38-404a-9ea2-a156c077cd57]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=d686f242-82a9-4b48-a13f-02a0ffaa4fcd/7dabced3-82a6-4fb0-9bc4-e0e8d2f29043]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6a4a0757-206a-465d-a34e-a2bb1f228cbc/92b708c6-23f9-4fe4-bc05-9308f8a944c7]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/b25eea12-0a45-4b95-9e7e-c9ef61a14065]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=128074ff-531e-4e03-b146-fd791a836acf/1b773ff7-5535-47ce-a025-0d335016a584]
module.keycloak_dev.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0d959a7b-d57d-4f79-b25a-e14eefd6b776]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c0785060-dfec-450d-808b-5ec810648444/8637e09f-48cc-4642-84e1-baf4a1095ae7]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/0b2bc369-2b95-4761-b1e8-28c06d4bcb7e]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7ddf135a-679f-4ff9-9fb4-94ef319ba865/c05e7ab0-0744-4442-a84d-27b0fcbe8441]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0b0c571a-e7ec-4905-b97d-be1e8eb7e379/abe4b627-40d1-4055-98da-609ea09166da]
module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/2957a6d0-c098-444b-93da-76f26f20b9a9]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6d8bfed8-61a2-4ea1-9cc5-c98fd9d42bc1]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=adb8d1c8-da4e-4088-8bd4-57211ebed14f/3786aae7-0e59-4dbb-a748-6ea59a6725e9]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/e12995fb-140b-4e68-ac99-92c79cfa57d4]
module.keycloak_dev.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=70bf6306-95d6-422f-8d26-17b0fb3dd16a/3959e277-6efb-4d92-bd41-bf0ddc0f0f27]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=8f4dc084-a23e-42aa-b1e5-f2b29ffdfdce/23e66593-546f-4a83-8445-a0b329fb6267]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/49f31084-af2a-422d-ac01-a95bfed98ac1]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a9286798-143c-49da-9257-ee9f3b64b9f2/a12e7e7c-311b-4777-9867-d193636e1fb4]
module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/1d33db47-cac1-46b4-a192-32db327dbb2a]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e7c73e24-74c2-4e8d-9bfb-cfcf352091ff/1eadc317-f2c1-4d73-a056-85ecbf558bd6]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/d9e717af-c1a0-4e60-917b-e5fd0b8605e0]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0b20e5f2-4b69-4802-944d-14c5f56e1b92/57ae02d4-10cb-455a-bdb5-ac7d4e5d577f]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0b267e01-2381-40f8-bd54-d7bd5d066cfc]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/640cddc0-0a96-4353-a497-49d43843dec4]
module.keycloak_dev.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=749ee6e5-075f-4ce3-8fca-a0da430829bb/c09a727a-0376-44f2-b93d-d498282a44d8]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6f3c77c5-9c2e-4363-873c-2325a32cf931]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3cd7e7aa-bea4-4b46-8172-95cc0a3599cb/3580af76-7b0e-41e3-8bdf-051b4828cdd8]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=69874174-f1b4-46dc-8616-63fec0550542/32744bd9-d277-4c15-850a-d6d8a1148ee9]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/2eb8a739-7238-4d04-a2c3-2dfa865f9ee2]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=192da01c-5b7a-45ff-a1ae-729b8e2966c8/9a6b2c12-58cd-46eb-a2ae-bf1dcde6e34e]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/111cb1dd-80a1-4487-b4d5-9410c61c09f2]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7d850303-2381-400e-9988-96961034166b/a2844734-3ca7-4122-ae1b-fd20e6b13e96]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/92d79f74-d92c-4c7b-af5c-6efd5db3c5ce]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=platform-services/4c015a44-48f9-42de-a8a9-4223371ac694]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=56d515dc-68ef-4a12-90ec-f0fdb278065c/14c30e42-b13c-4f02-b1ed-79e8806dcb3e]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/b6520156-428f-4ec8-9c2d-439c96317272]
module.keycloak_dev.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a1c62ba7-ddb9-45d9-ac9a-5f8c601af5e4/a197db4a-c480-4b80-8280-ca8c8662ccac]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/f9098b76-2b81-4fc8-82cb-a41cbddbd11d]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=571d9805-8046-4807-bc17-57e764f02267/830c068f-29c3-447e-afdb-98675ffb4492]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5e954b03-120c-4d55-915b-134d780052eb/a0c75525-8510-439a-abf3-9ff59ac12564]
module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6442bf46-5f05-4ef4-88ef-19063d371809]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=platform-services/58f014e9-19bd-4f84-897a-896fcd773003]
module.keycloak_dev.module.custom_realms.module.platform-services.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c456acc7-f600-4dfb-baa6-200c5f1f5334/bd869ec1-c3cc-4f53-9b3b-9c08bd2ab8c1]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/388aeba3-f603-453a-b9df-80934af58375]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6d4c1e09-b058-443b-917a-cd61e1236919/d405c97e-9813-4c52-b348-111960deceaa]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7a464a0c-4a8a-49b5-9447-9b21c376d0f2/decf86fc-d08e-4b7a-8cc1-6cf811b3f639]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/0f68d571-c1b0-4797-b713-248da94b8dc1]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/f9813d6f-347c-4955-bb79-6d4a9813d13e]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=947ac6bf-ebd3-42fe-852a-a5a4e7a8b021/636ffa5f-cd33-460e-998f-7c6c941bf056]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/4117272a-fa7b-45c7-ba7a-de1124a33bd3]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9ebc5624-16a2-4e60-a292-4133ead765d2/44fce37c-4c8d-460b-b902-8ace03cda4d1]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=dcaf5361-b719-4d29-b1e6-c080915bac98/dd65a371-640c-48ee-8d0c-3acdc8057862]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/8e36f9fa-a325-4d1b-8b5a-ff0c4c935ecb]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/535b95b8-4a10-4714-8813-a5ea6a237493]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f576068e-299d-4ae1-9913-52e293a54595/4d0795bc-2cf0-4245-ba86-506c0368c5e5]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/0ec34b63-34b0-48ab-a2cf-5c0df85a26ec]
module.keycloak_dev.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=8552a15d-0655-4594-877c-1381ed265f5b/5461c769-ffeb-4cff-98db-eb63190afe78]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ed7d19d6-7d2f-4d0a-991b-483bb4065b74/7354c435-1b1a-4f13-8ab6-b8ccb3c25b0d]
module.keycloak_dev.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/e83b2556-af9a-4960-be94-5c5682adc654]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6f00aff7-3521-4471-88c0-a2a49bea8677/3fd996cb-16d4-41ef-b7cd-99c8add77799]
module.keycloak_dev.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/1a814baf-543c-469b-a884-a8f9d8418a77]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=prime/8c4ea037-a745-448e-b597-4e11f78e5b5a]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=fbbeff97-cf40-48be-be2b-a6c88954d654/1fd1ed24-aede-4d21-9afd-c60d8fd6de6f]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fabeb7ab-b5dc-4734-960b-790c27924e38]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ce3f8c8c-299e-459b-a92c-a6d666eb03fb/f3318181-1ffb-439d-b8d2-4cab347b9d42]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=prime/9d716702-a066-4d18-83ef-f90c8b07d1f8]
module.keycloak_dev.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=101d53a9-53a7-4832-97e2-736e1b790f57/7a46d8a4-db6b-40f1-a1b3-2249afa882ad]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_realms.module.foi-mod.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "foi-mod"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "734a7828-4ccd-480b-af41-12df4f611fec"
        name       = "foi-mod Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "4f387e38-07d0-4292-a944-f4ba9993545e"
        name                                       = "foi-mod-realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "01750aec-688b-46d2-886b-c49b0b46cab3"
        name            = "foi-mod-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "18aeffa5-71c8-4ac3-9d19-337c5b87fba8"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "1253c8ab-f55f-4307-bd1f-d404bcf49a5b"
        name                                       = "realm-admin-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "a96babe3-664f-469b-8154-820987f75824"
        name            = "realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group.group has changed
  ~ resource "keycloak_group" "group" {
      + attributes = {}
        id         = "65d3d23f-c9d9-48ae-a492-872980eaaa6c"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has changed
  ~ resource "keycloak_openid_client" "service_account" {
      + extra_config                               = {}
        id                                         = "4eb00bd5-d475-4bf8-9550-b3b0bd4af4a5"
        name                                       = "realm-viewer-cli"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_role.role has changed
  ~ resource "keycloak_role" "role" {
      + attributes      = {}
        id              = "9f409cb6-ea27-43fc-a469-2e77a5fbf482"
        name            = "realm-viewer"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_test.module.custom_realms.module.testing-nithin.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "testing-nithin"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "testing-nithin-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.testing-nithin.module.```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*